import React from 'react';
import s from "@/app/page.module.scss";
import MainScreen from "@/components/MainScreen/MainScreen";
import {EPages, ITableData} from "@/types/types";
import Prices from "@/components/Prices/Prices";
import Benefits from "@/components/Benefits/Benefits";
import Order from "@/components/Order/Order";
import Table from "@/components/Table/Table";
import NavLinks from "@/components/NavLinks/NavLinks";
import Faq from "@/components/Faq/Faq";
import MoreQuestions from "@/components/MoreQuestions/MoreQuestions";

const Stair = () => {
    const firstTableData: ITableData = {
        thead: ['Комплектация', 'Рабочая высота (м)', 'Общая высота (м)', 'Высота до настила (м)', 'Вес (ВСР-1), кг', 'Вес (ВСР-4), кг', 'Вес (ВСР-7), кг'],
        tbody: [
            ['1 промежуточная секция + базовый блок', '7,6', '7,6', '7,6', '7,6', '7,6', '7,6'],
            ['2 промежуточная секция + базовый блок', '0,7 * 1,6', '0,7 * 1,6', '0,7 * 1,6', '0,7 * 1,6', '0,7 * 1,6', '0,7 * 1,6'],
            ['3 промежуточная секция + базовый блок', '250', '250', '250', '250', '250', '250'],
            ['4 промежуточная секция + базовый блок', '1', '1', '1', '1', '1', '1'],
            ['5 промежуточная секция + базовый блок', '1,23', '1,23', '1,23', '1,23', '1,23', '1,23'],
            ['6 промежуточная секция + базовый блок', '0,84х2', '0,84х2', '0,84х2', '0,84х2', '0,84х2', '0,84х2'],
            ['7 промежуточная секция + базовый блок', '7,6', '7,6', '7,6', '7,6', '7,6', '7,6'],
            ['8 промежуточная секция + базовый блок', '0,7 * 1,6', '0,7 * 1,6', '0,7 * 1,6', '0,7 * 1,6', '0,7 * 1,6', '0,7 * 1,6'],
            ['9 промежуточная секция + базовый блок', '250', '250', '250', '250', '250', '250'],
            ['10 промежуточная секция + базовый блок', '1', '1', '1', '1', '1', '1'],
            ['11 промежуточная секция + базовый блок', '1,23', '1,23', '1,23', '1,23', '1,23', '1,23'],
            ['12 промежуточная секция + базовый блок', '0,84х2', '0,84х2', '0,84х2', '0,84х2', '0,84х2', '0,84х2'],
            ['13 промежуточная секция + базовый блок', '250', '250', '250', '250', '250', '250'],
            ['14 промежуточная секция + базовый блок', '1', '1', '1', '1', '1', '1'],
            ['15 промежуточная секция + базовый блок', '1,23', '1,23', '1,23', '1,23', '1,23', '1,23'],
            ['16 промежуточная секция + базовый блок', '0,84х2', '0,84х2', '0,84х2', '0,84х2', '0,84х2', '0,84х2'],
        ]
    }

    const secondTableData: ITableData = {
        thead: ['', 'Вышка тура ВСР-1', 'Вышка тура ВСР-1', 'Вышка тура ВСР-1'],
        tbody: [
            ['Максимальная высота вышки, м', '7,6', '7,6', '7,6'],
            ['Размеры рабочей площадки, м:', '0,7 * 1,6', '0,7 * 1,6', '0,7 * 1,6'],
            ['Максимальная нагрузка на вышку, кг', '250', '250', '250'],
            ['Количество настилов, шт', '1', '1', '1'],
            ['Высота секции вышки, м', '1,23', '1,23', '1,23'],
            ['Размер колесного основания в сборе, м', '0,84х2', '0,84х2', '0,84х2'],
        ]
    }

    return (
        <div className={s.home}>
            <MainScreen viewMode={{'page': EPages.tower, 'component': 'main_screen'}}/>
            <Prices viewMode={{'page': EPages.tower, 'component': 'main_screen'}}/>
            <Benefits/>
            <Order/>
            <div className={'container'}>
                <h2 className={s.table_title}>Технические характеристики вышки туры передвижной</h2>
                <Table tableData={firstTableData}/>
            </div>
            <div className={'container'}>
                <h2 className={s.table_title}>Подробные технические характеристики вышки туры передвижной</h2>
                <Table tableData={secondTableData}/>
            </div>
            <NavLinks viewMode={{'page': EPages.tower, 'component': 'none'}}/>
            <Faq/>
            <MoreQuestions/>
        </div>
    )
};

export default Stair;